read_verilog -specify -lib +/gowin/cells_sim.v

read_verilog uart.v au.v lu.v cu.v alu.v decoder.v immdecoder.v furv.v ram.v shifter.v rom_sim.v led.v top.v

hierarchy -top top

proc

alumacc
share -aggressive

flatten
pmux2shiftx -min_density 75;
opt -fast
techmap t:$shiftx
muxcover -mux4 -mux8
memory -nomap
opt -fine -full

synth_gowin -nobram -abc9
techmap -map rom.v -autoproc
memory
techmap -map +/techmap.v
abc -lut 4:8
techmap -map +/gowin/cells_map.v

stat
write_json myrv.json