read_verilog au.v lu.v cu.v alu.v decoder.v immdecoder.v furv.v ram.v uart.v shifter.v rom_sim.v top.v

hierarchy -top top;;

proc;;

alumacc *\au*;;
share -aggressive *\au*;;
opt -full -fine *\au*;;

alumacc *\cu*

share -aggressive *\shifter*;
opt -fine -full *\shifter*;;

flatten *alu*

flatten;;
opt -fast;;
memory -nomap;;
opt -fine -full;;
share -aggressive;;

techmap -map rom.v -autoproc
synth_gowin -nobram -abc9

write_json myrv.json